Repository: despokd/wp-cf7-newsletter
Catalog: cf7-newsletter/languages/cf7-newsletter-*.po
Languages: de_de

source: Catch CF7 submissions and provide double optin
de_de: Erfasse CF7 Newsletter Anmeldungen und nutze Double Optin

source: Form data
de_de: Formulardaten

source: New subscriber
de_de: Neuer Abonnent

source: No Submissions found
de_de: Keine Anmeldungen gefunden

source: No Submissions found in Trash
de_de: Keine Anmeldungen i Papierkorb gefunden

source: Search Submissions
de_de: Suche Anmeldungen

source: Something went wrong. Please try again.
de_de: Es ist ein Fehler aufgetreten. Bitte versuche es erneut.

source: Submission
de_de: Anmeldung

source: Submission data
de_de: Anmeldedaten

source: Submissions
de_de: Anmeldungen

source: Unsubscribe
de_de: Abmelden

source: View Submission
de_de: Anmeldung anzeigen

source: You have been successfully subscribed to our newsletter.
de_de: Du hast dich erfolgreich f√ºr unseren Newsletter angemeldet.
